{
  "format": "layers-model",
  "generatedBy": "keras v2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "2.19.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "mobilenetv2_1.00_224",
              "trainable": false,
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 224, 224, 3],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                  },
                  "name": "input_1",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "Conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [3, 3],
                    "strides": [2, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "module": "keras.initializers",
                      "class_name": "GlorotUniform",
                      "config": {"seed": null},
                      "registered_name": null
                    },
                    "bias_initializer": {
                      "module": "keras.initializers",
                      "class_name": "Zeros",
                      "config": {},
                      "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "Conv1",
                  "inbound_nodes": [["input_1", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "bn_Conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "bn_Conv1",
                  "inbound_nodes": [["Conv1", 0, 0, {}]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "Conv1_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "Conv1_relu",
                  "inbound_nodes": [["bn_Conv1", 0, 0, {}]]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "expanded_conv_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [3, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "expanded_conv_depthwise",
                  "inbound_nodes": [["Conv1_relu", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "expanded_conv_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "expanded_conv_depthwise_BN",
                  "inbound_nodes": [["expanded_conv_depthwise", 0, 0, {}]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "expanded_conv_depthwise_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "expanded_conv_depthwise_relu",
                  "inbound_nodes": [["expanded_conv_depthwise_BN", 0, 0, {}]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "expanded_conv_project",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "expanded_conv_project",
                  "inbound_nodes": [["expanded_conv_depthwise_relu", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "expanded_conv_project_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "expanded_conv_project_BN",
                  "inbound_nodes": [["expanded_conv_project", 0, 0, {}]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_1_expand",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_1_expand",
                  "inbound_nodes": [["expanded_conv_project_BN", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_expand_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_expand_BN",
                  "inbound_nodes": [["block_1_expand", 0, 0, {}]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_1_expand_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_1_expand_relu",
                  "inbound_nodes": [["block_1_expand_BN", 0, 0, {}]]
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "block_1_pad",
                    "trainable": false,
                    "dtype": "float32",
                    "padding": [[0, 1], [0, 1]],
                    "data_format": "channels_last"
                  },
                  "name": "block_1_pad",
                  "inbound_nodes": [["block_1_expand_relu", 0, 0, {}]]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "block_1_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [3, 3],
                    "strides": [2, 2],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "block_1_depthwise",
                  "inbound_nodes": [["block_1_pad", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_depthwise_BN",
                  "inbound_nodes": [["block_1_depthwise", 0, 0, {}]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_1_depthwise_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_1_depthwise_relu",
                  "inbound_nodes": [["block_1_depthwise_BN", 0, 0, {}]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_1_project",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 24,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_1_project",
                  "inbound_nodes": [["block_1_depthwise_relu", 0, 0, {}]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_project_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null},
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_project_BN",
                  "inbound_nodes": [["block_1_project", 0, 0, {}]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_2_expand",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 144,
                    "kernel_size": [1, 1],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null},
                    "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null},
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_2_expand",
                  "inbound_nodes": [["block_1_project_BN", 0, 0, {}]]
                }
              ],
              "input_layers": [["input_1", 0, 0]],
              "output_layers": [["out_relu", 0, 0]]
            },
            "name": "mobilenetv2_1.00_224",
            "inbound_nodes": [["input_2", 0, 0, {}]]
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling2d",
            "inbound_nodes": [["mobilenetv2_1.00_224", 0, 0, {}]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [["global_average_pooling2d", 0, 0, {}]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 5,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {"seed": null},
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [["dropout", 0, 0, {}]]
          }
        ],
        "input_layers": [["input_2", 0, 0]],
        "output_layers": [["dense", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [1280, 5], "dtype": "float32"},
        {"name": "dense/bias", "shape": [5], "dtype": "float32"},
        {"name": "Conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "bn_Conv1/gamma", "shape": [32], "dtype": "float32"},
        {"name": "bn_Conv1/beta", "shape": [32], "dtype": "float32"},
        {"name": "bn_Conv1/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "bn_Conv1/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "expanded_conv_depthwise/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"},
        {"name": "expanded_conv_depthwise_BN/gamma", "shape": [32], "dtype": "float32"},
        {"name": "expanded_conv_depthwise_BN/beta", "shape": [32], "dtype": "float32"},
        {"name": "expanded_conv_depthwise_BN/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "expanded_conv_depthwise_BN/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "expanded_conv_project/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"},
        {"name": "expanded_conv_project_BN/gamma", "shape": [16], "dtype": "float32"},
        {"name": "expanded_conv_project_BN/beta", "shape": [16], "dtype": "float32"},
        {"name": "expanded_conv_project_BN/moving_mean", "shape": [16], "dtype": "float32"},
        {"name": "expanded_conv_project_BN/moving_variance", "shape": [16], "dtype": "float32"},
        {"name": "block_1_expand/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"},
        {"name": "block_1_expand_BN/gamma", "shape": [96], "dtype": "float32"},
        {"name": "block_1_expand_BN/beta", "shape": [96], "dtype": "float32"},
        {"name": "block_1_expand_BN/moving_mean", "shape": [96], "dtype": "float32"},
        {"name": "block_1_expand_BN/moving_variance", "shape": [96], "dtype": "float32"},
        {"name": "block_1_depthwise/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"},
        {"name": "block_1_depthwise_BN/gamma", "shape": [96], "dtype": "float32"},
        {"name": "block_1_depthwise_BN/beta", "shape": [96], "dtype": "float32"},
        {"name": "block_1_depthwise_BN/moving_mean", "shape": [96], "dtype": "float32"},
        {"name": "block_1_depthwise_BN/moving_variance", "shape": [96], "dtype": "float32"},
        {"name": "block_1_project/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"},
        {"name": "block_1_project_BN/gamma", "shape": [24], "dtype": "float32"},
        {"name": "block_1_project_BN/beta", "shape": [24], "dtype": "float32"},
        {"name": "block_1_project_BN/moving_mean", "shape": [24], "dtype": "float32"},
        {"name": "block_1_project_BN/moving_variance", "shape": [24], "dtype": "float32"},
        {"name": "block_2_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"},
        {"name": "block_2_expand_BN/gamma", "shape": [144], "dtype": "float32"},
        {"name": "block_2_expand_BN/beta", "shape": [144], "dtype": "float32"},
        {"name": "block_2_expand_BN/moving_mean", "shape": [144], "dtype": "float32"},
        {"name": "block_2_expand_BN/moving_variance", "shape": [144], "dtype": "float32"},
        {"name": "block_2_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"},
        {"name": "block_2_depthwise_BN/gamma", "shape": [144], "dtype": "float32"},
        {"name": "block_2_depthwise_BN/beta", "shape": [144], "dtype": "float32"},
        {"name": "block_2_depthwise_BN/moving_mean", "shape": [144], "dtype": "float32"},
        {"name": "block_2_depthwise_BN/moving_variance", "shape": [144], "dtype": "float32"},
        {"name": "block_2_project/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"},
        {"name": "block_2_project_BN/gamma", "shape": [24], "dtype": "float32"},
        {"name": "block_2_project_BN/beta", "shape": [24], "dtype": "float32"},
        {"name": "block_2_project_BN/moving_mean", "shape": [24], "dtype": "float32"},
        {"name": "block_2_project_BN/moving_variance", "shape": [24], "dtype": "float32"},
        {"name": "block_3_expand/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"},
        {"name": "block_3_expand_BN/gamma", "shape": [144], "dtype": "float32"},
        {"name": "block_3_expand_BN/beta", "shape": [144], "dtype": "float32"},
        {"name": "block_3_expand_BN/moving_mean", "shape": [144], "dtype": "float32"},
        {"name": "block_3_expand_BN/moving_variance", "shape": [144], "dtype": "float32"},
        {"name": "block_3_depthwise/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"},
        {"name": "block_3_depthwise_BN/gamma", "shape": [144], "dtype": "float32"},
        {"name": "block_3_depthwise_BN/beta", "shape": [144], "dtype": "float32"},
        {"name": "block_3_depthwise_BN/moving_mean", "shape": [144], "dtype": "float32"},
        {"name": "block_3_depthwise_BN/moving_variance", "shape": [144], "dtype": "float32"},
        {"name": "block_3_project/kernel", "shape": [1, 1, 144, 32], "dtype": "float32"},
        {"name": "block_3_project_BN/gamma", "shape": [32], "dtype": "float32"},
        {"name": "block_3_project_BN/beta", "shape": [32], "dtype": "float32"},
        {"name": "block_3_project_BN/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "block_3_project_BN/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "block_4_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"},
        {"name": "block_4_expand_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_4_expand_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_4_expand_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_4_expand_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_4_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"},
        {"name": "block_4_depthwise_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_4_depthwise_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_4_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_4_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_4_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"},
        {"name": "block_4_project_BN/gamma", "shape": [32], "dtype": "float32"},
        {"name": "block_4_project_BN/beta", "shape": [32], "dtype": "float32"},
        {"name": "block_4_project_BN/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "block_4_project_BN/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "block_5_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"},
        {"name": "block_5_expand_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_5_expand_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_5_expand_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_5_expand_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_5_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"},
        {"name": "block_5_depthwise_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_5_depthwise_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_5_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_5_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_5_project/kernel", "shape": [1, 1, 192, 32], "dtype": "float32"},
        {"name": "block_5_project_BN/gamma", "shape": [32], "dtype": "float32"},
        {"name": "block_5_project_BN/beta", "shape": [32], "dtype": "float32"},
        {"name": "block_5_project_BN/moving_mean", "shape": [32], "dtype": "float32"},
        {"name": "block_5_project_BN/moving_variance", "shape": [32], "dtype": "float32"},
        {"name": "block_6_expand/kernel", "shape": [1, 1, 32, 192], "dtype": "float32"},
        {"name": "block_6_expand_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_6_expand_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_6_expand_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_6_expand_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_6_depthwise/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"},
        {"name": "block_6_depthwise_BN/gamma", "shape": [192], "dtype": "float32"},
        {"name": "block_6_depthwise_BN/beta", "shape": [192], "dtype": "float32"},
        {"name": "block_6_depthwise_BN/moving_mean", "shape": [192], "dtype": "float32"},
        {"name": "block_6_depthwise_BN/moving_variance", "shape": [192], "dtype": "float32"},
        {"name": "block_6_project/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"},
        {"name": "block_6_project_BN/gamma", "shape": [64], "dtype": "float32"},
        {"name": "block_6_project_BN/beta", "shape": [64], "dtype": "float32"},
        {"name": "block_6_project_BN/moving_mean", "shape": [64], "dtype": "float32"},
        {"name": "block_6_project_BN/moving_variance", "shape": [64], "dtype": "float32"},
        {"name": "block_7_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"},
        {"name": "block_7_expand_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_7_expand_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_7_expand_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_7_expand_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_7_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"},
        {"name": "block_7_depthwise_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_7_depthwise_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_7_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_7_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_7_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"},
        {"name": "block_7_project_BN/gamma", "shape": [64], "dtype": "float32"},
        {"name": "block_7_project_BN/beta", "shape": [64], "dtype": "float32"},
        {"name": "block_7_project_BN/moving_mean", "shape": [64], "dtype": "float32"},
        {"name": "block_7_project_BN/moving_variance", "shape": [64], "dtype": "float32"},
        {"name": "block_8_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"},
        {"name": "block_8_expand_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_8_expand_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_8_expand_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_8_expand_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_8_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"},
        {"name": "block_8_depthwise_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_8_depthwise_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_8_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_8_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_8_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"},
        {"name": "block_8_project_BN/gamma", "shape": [64], "dtype": "float32"},
        {"name": "block_8_project_BN/beta", "shape": [64], "dtype": "float32"},
        {"name": "block_8_project_BN/moving_mean", "shape": [64], "dtype": "float32"},
        {"name": "block_8_project_BN/moving_variance", "shape": [64], "dtype": "float32"},
        {"name": "block_9_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"},
        {"name": "block_9_expand_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_9_expand_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_9_expand_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_9_expand_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_9_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"},
        {"name": "block_9_depthwise_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_9_depthwise_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_9_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_9_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_9_project/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"},
        {"name": "block_9_project_BN/gamma", "shape": [64], "dtype": "float32"},
        {"name": "block_9_project_BN/beta", "shape": [64], "dtype": "float32"},
        {"name": "block_9_project_BN/moving_mean", "shape": [64], "dtype": "float32"},
        {"name": "block_9_project_BN/moving_variance", "shape": [64], "dtype": "float32"},
        {"name": "block_10_expand/kernel", "shape": [1, 1, 64, 384], "dtype": "float32"},
        {"name": "block_10_expand_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_10_expand_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_10_expand_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_10_expand_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_10_depthwise/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"},
        {"name": "block_10_depthwise_BN/gamma", "shape": [384], "dtype": "float32"},
        {"name": "block_10_depthwise_BN/beta", "shape": [384], "dtype": "float32"},
        {"name": "block_10_depthwise_BN/moving_mean", "shape": [384], "dtype": "float32"},
        {"name": "block_10_depthwise_BN/moving_variance", "shape": [384], "dtype": "float32"},
        {"name": "block_10_project/kernel", "shape": [1, 1, 384, 96], "dtype": "float32"},
        {"name": "block_10_project_BN/gamma", "shape": [96], "dtype": "float32"},
        {"name": "block_10_project_BN/beta", "shape": [96], "dtype": "float32"},
        {"name": "block_10_project_BN/moving_mean", "shape": [96], "dtype": "float32"},
        {"name": "block_10_project_BN/moving_variance", "shape": [96], "dtype": "float32"},
        {"name": "block_11_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"},
        {"name": "block_11_expand_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_11_expand_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_11_expand_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_11_expand_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_11_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"},
        {"name": "block_11_depthwise_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_11_depthwise_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_11_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_11_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_11_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"},
        {"name": "block_11_project_BN/gamma", "shape": [96], "dtype": "float32"},
        {"name": "block_11_project_BN/beta", "shape": [96], "dtype": "float32"},
        {"name": "block_11_project_BN/moving_mean", "shape": [96], "dtype": "float32"},
        {"name": "block_11_project_BN/moving_variance", "shape": [96], "dtype": "float32"},
        {"name": "block_12_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"},
        {"name": "block_12_expand_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_12_expand_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_12_expand_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_12_expand_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_12_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"},
        {"name": "block_12_depthwise_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_12_depthwise_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_12_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_12_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_12_project/kernel", "shape": [1, 1, 576, 96], "dtype": "float32"},
        {"name": "block_12_project_BN/gamma", "shape": [96], "dtype": "float32"},
        {"name": "block_12_project_BN/beta", "shape": [96], "dtype": "float32"},
        {"name": "block_12_project_BN/moving_mean", "shape": [96], "dtype": "float32"},
        {"name": "block_12_project_BN/moving_variance", "shape": [96], "dtype": "float32"},
        {"name": "block_13_expand/kernel", "shape": [1, 1, 96, 576], "dtype": "float32"},
        {"name": "block_13_expand_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_13_expand_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_13_expand_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_13_expand_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_13_depthwise/depthwise_kernel", "shape": [3, 3, 576, 1], "dtype": "float32"},
        {"name": "block_13_depthwise_BN/gamma", "shape": [576], "dtype": "float32"},
        {"name": "block_13_depthwise_BN/beta", "shape": [576], "dtype": "float32"},
        {"name": "block_13_depthwise_BN/moving_mean", "shape": [576], "dtype": "float32"},
        {"name": "block_13_depthwise_BN/moving_variance", "shape": [576], "dtype": "float32"},
        {"name": "block_13_project/kernel", "shape": [1, 1, 576, 160], "dtype": "float32"},
        {"name": "block_13_project_BN/gamma", "shape": [160], "dtype": "float32"},
        {"name": "block_13_project_BN/beta", "shape": [160], "dtype": "float32"},
        {"name": "block_13_project_BN/moving_mean", "shape": [160], "dtype": "float32"},
        {"name": "block_13_project_BN/moving_variance", "shape": [160], "dtype": "float32"},
        {"name": "block_14_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"},
        {"name": "block_14_expand_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_14_expand_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_14_expand_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_14_expand_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_14_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"},
        {"name": "block_14_depthwise_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_14_depthwise_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_14_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_14_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_14_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"},
        {"name": "block_14_project_BN/gamma", "shape": [160], "dtype": "float32"},
        {"name": "block_14_project_BN/beta", "shape": [160], "dtype": "float32"},
        {"name": "block_14_project_BN/moving_mean", "shape": [160], "dtype": "float32"},
        {"name": "block_14_project_BN/moving_variance", "shape": [160], "dtype": "float32"},
        {"name": "block_15_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"},
        {"name": "block_15_expand_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_15_expand_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_15_expand_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_15_expand_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_15_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"},
        {"name": "block_15_depthwise_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_15_depthwise_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_15_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_15_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_15_project/kernel", "shape": [1, 1, 960, 160], "dtype": "float32"},
        {"name": "block_15_project_BN/gamma", "shape": [160], "dtype": "float32"},
        {"name": "block_15_project_BN/beta", "shape": [160], "dtype": "float32"},
        {"name": "block_15_project_BN/moving_mean", "shape": [160], "dtype": "float32"},
        {"name": "block_15_project_BN/moving_variance", "shape": [160], "dtype": "float32"},
        {"name": "block_16_expand/kernel", "shape": [1, 1, 160, 960], "dtype": "float32"},
        {"name": "block_16_expand_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_16_expand_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_16_expand_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_16_expand_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_16_depthwise/depthwise_kernel", "shape": [3, 3, 960, 1], "dtype": "float32"},
        {"name": "block_16_depthwise_BN/gamma", "shape": [960], "dtype": "float32"},
        {"name": "block_16_depthwise_BN/beta", "shape": [960], "dtype": "float32"},
        {"name": "block_16_depthwise_BN/moving_mean", "shape": [960], "dtype": "float32"},
        {"name": "block_16_depthwise_BN/moving_variance", "shape": [960], "dtype": "float32"},
        {"name": "block_16_project/kernel", "shape": [1, 1, 960, 320], "dtype": "float32"},
        {"name": "block_16_project_BN/gamma", "shape": [320], "dtype": "float32"},
        {"name": "block_16_project_BN/beta", "shape": [320], "dtype": "float32"},
        {"name": "block_16_project_BN/moving_mean", "shape": [320], "dtype": "float32"},
        {"name": "block_16_project_BN/moving_variance", "shape": [320], "dtype": "float32"},
        {"name": "Conv_1/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"},
        {"name": "Conv_1_bn/gamma", "shape": [1280], "dtype": "float32"},
        {"name": "Conv_1_bn/beta", "shape": [1280], "dtype": "float32"},
        {"name": "Conv_1_bn/moving_mean", "shape": [1280], "dtype": "float32"},
        {"name": "Conv_1_bn/moving_variance", "shape": [1280], "dtype": "float32"}
      ]
    }
  ]
}
